nxp-mcuxpresso/mcuxsdk-examples/_boards/imx95lpd5evk19/lwip_examples/lwip_ping/bm/cm7/pin_mux.c
/*
 * TEXT BELOW IS USED AS SETTING FOR TOOLS *************************************
BOARD_InitPinsRmii:
- options: {callFromInitBoot: 'false', coreID: cm7}
- pin_list:
  - {pin_num: AH26, peripheral: ETH1, signal: eth_rmii_crs_dv, pin_signal: ENET2_RX_CTL, PD: ENABLED, FSEL1:
SLIGHTLY_FAST_SLEW_RATE, DSE: X4}
  - {pin_num: AF28, peripheral: ETH1, signal: eth_rmii_ref_clk, pin_signal: ENET2_TD2, APC_LCK: APC_LCK_2, PD: ENABLED,
FSEL1: SLIGHTLY_FAST_SLEW_RATE, DSE: X6}
  - {pin_num: AJ29, peripheral: ETH1, signal: eth_rmii_rx_er, pin_signal: ENET2_RD2, PD: ENABLED, FSEL1:
SLIGHTLY_FAST_SLEW_RATE, DSE: X4}
  - {pin_num: AJ27, peripheral: ETH1, signal: 'eth_rmii_rxd, 0', pin_signal: ENET2_RD0, PD: ENABLED, DSE: X4}
  - {pin_num: AK28, peripheral: ETH1, signal: 'eth_rmii_rxd, 1', pin_signal: ENET2_RD1, PD: ENABLED, DSE: X4}
  - {pin_num: AF24, peripheral: ETH1, signal: eth_rmii_tx_en, pin_signal: ENET2_TX_CTL, PD: ENABLED, DSE: X4}
  - {pin_num: AG25, peripheral: ETH1, signal: 'eth_rmii_txd, 0', pin_signal: ENET2_TD0, PD: ENABLED, DSE: X4}
  - {pin_num: AG27, peripheral: ETH1, signal: 'eth_rmii_txd, 1', pin_signal: ENET2_TD1, PD: ENABLED, DSE: X4}
  - {pin_num: AG23, peripheral: ENET, signal: enet_clk_root, pin_signal: ENET2_TXC, APC_LCK: APC_LCK_2, PD: ENABLED,
FSEL1: SLIGHTLY_FAST_SLEW_RATE, DSE: X6}
 * BE CAREFUL MODIFYING THIS COMMENT - IT IS YAML SETTINGS FOR TOOLS ***********
 */

/* FUNCTION ************************************************************************************************************
 *
 * Function Name : BOARD_InitPinsRmii
 * Description   : Configures pin routing and optionally pin electrical features.
 *
 * END ****************************************************************************************************************/
void BOARD_InitPinsRmii(void)
{ /*!< Function assigned for the core: Cortex-M7F[cm7] */
    HAL_PinctrlSetPinMux(HAL_PINCTRL_PLATFORM_IOMUXC_PAD_ENET2_RD0__ETH1_RMII_RXD0, 0U);
    HAL_PinctrlSetPinCfg(HAL_PINCTRL_PLATFORM_IOMUXC_PAD_ENET2_RD0__ETH1_RMII_RXD0,
                         HAL_PINCTRL_PLATFORM_IOMUXC_PAD_DSE(15U) | HAL_PINCTRL_PLATFORM_IOMUXC_PAD_FSEL1(2U) |
                             HAL_PINCTRL_PLATFORM_IOMUXC_PAD_PD_MASK);
    HAL_PinctrlSetPinMux(HAL_PINCTRL_PLATFORM_IOMUXC_PAD_ENET2_RD1__ETH1_RMII_RXD1, 0U);
    HAL_PinctrlSetPinCfg(HAL_PINCTRL_PLATFORM_IOMUXC_PAD_ENET2_RD1__ETH1_RMII_RXD1,
                         HAL_PINCTRL_PLATFORM_IOMUXC_PAD_DSE(15U) | HAL_PINCTRL_PLATFORM_IOMUXC_PAD_FSEL1(2U) |
                             HAL_PINCTRL_PLATFORM_IOMUXC_PAD_PD_MASK);
    HAL_PinctrlSetPinMux(HAL_PINCTRL_PLATFORM_IOMUXC_PAD_ENET2_RD2__ETH1_RMII_RX_ER, 0U);
    HAL_PinctrlSetPinCfg(HAL_PINCTRL_PLATFORM_IOMUXC_PAD_ENET2_RD2__ETH1_RMII_RX_ER,
                         HAL_PINCTRL_PLATFORM_IOMUXC_PAD_DSE(15U) | HAL_PINCTRL_PLATFORM_IOMUXC_PAD_FSEL1(2U) |
                             HAL_PINCTRL_PLATFORM_IOMUXC_PAD_PD_MASK);
    HAL_PinctrlSetPinMux(HAL_PINCTRL_PLATFORM_IOMUXC_PAD_ENET2_RX_CTL__ETH1_RMII_CRS_DV, 0U);
    HAL_PinctrlSetPinCfg(HAL_PINCTRL_PLATFORM_IOMUXC_PAD_ENET2_RX_CTL__ETH1_RMII_CRS_DV,
                         HAL_PINCTRL_PLATFORM_IOMUXC_PAD_DSE(15U) | HAL_PINCTRL_PLATFORM_IOMUXC_PAD_FSEL1(2U) |
                             HAL_PINCTRL_PLATFORM_IOMUXC_PAD_PD_MASK);
    HAL_PinctrlSetPinMux(HAL_PINCTRL_PLATFORM_IOMUXC_PAD_ENET2_TD0__ETH1_RMII_TXD0, 0U);
    HAL_PinctrlSetPinCfg(HAL_PINCTRL_PLATFORM_IOMUXC_PAD_ENET2_TD0__ETH1_RMII_TXD0,
                         HAL_PINCTRL_PLATFORM_IOMUXC_PAD_DSE(15U) | HAL_PINCTRL_PLATFORM_IOMUXC_PAD_FSEL1(2U) |
                             HAL_PINCTRL_PLATFORM_IOMUXC_PAD_PD_MASK);
    HAL_PinctrlSetPinMux(HAL_PINCTRL_PLATFORM_IOMUXC_PAD_ENET2_TD1__ETH1_RMII_TXD1, 0U);
    HAL_PinctrlSetPinCfg(HAL_PINCTRL_PLATFORM_IOMUXC_PAD_ENET2_TD1__ETH1_RMII_TXD1,
                         HAL_PINCTRL_PLATFORM_IOMUXC_PAD_DSE(15U) | HAL_PINCTRL_PLATFORM_IOMUXC_PAD_FSEL1(2U) |
                             HAL_PINCTRL_PLATFORM_IOMUXC_PAD_PD_MASK);
    HAL_PinctrlSetPinMux(HAL_PINCTRL_PLATFORM_IOMUXC_PAD_ENET2_TD2__ETH1_RMII_REF50_CLK, 0U);
    HAL_PinctrlSetPinCfg(HAL_PINCTRL_PLATFORM_IOMUXC_PAD_ENET2_TD2__ETH1_RMII_REF50_CLK,
                         HAL_PINCTRL_PLATFORM_IOMUXC_PAD_DSE(63U) | HAL_PINCTRL_PLATFORM_IOMUXC_PAD_FSEL1(2U) |
                             HAL_PINCTRL_PLATFORM_IOMUXC_PAD_PD_MASK | HAL_PINCTRL_PLATFORM_IOMUXC_PAD_APC(32U));
    HAL_PinctrlSetPinMux(HAL_PINCTRL_PLATFORM_IOMUXC_PAD_ENET2_TXC__ENET_CLK_ROOT, 0U);
    HAL_PinctrlSetPinCfg(HAL_PINCTRL_PLATFORM_IOMUXC_PAD_ENET2_TXC__ENET_CLK_ROOT,
                         HAL_PINCTRL_PLATFORM_IOMUXC_PAD_DSE(63U) | HAL_PINCTRL_PLATFORM_IOMUXC_PAD_FSEL1(2U) |
                             HAL_PINCTRL_PLATFORM_IOMUXC_PAD_PD_MASK | HAL_PINCTRL_PLATFORM_IOMUXC_PAD_APC(32U));
    HAL_PinctrlSetPinMux(HAL_PINCTRL_PLATFORM_IOMUXC_PAD_ENET2_TX_CTL__ETH1_RMII_TX_EN, 0U);
    HAL_PinctrlSetPinCfg(HAL_PINCTRL_PLATFORM_IOMUXC_PAD_ENET2_TX_CTL__ETH1_RMII_TX_EN,
                         HAL_PINCTRL_PLATFORM_IOMUXC_PAD_DSE(15U) | HAL_PINCTRL_PLATFORM_IOMUXC_PAD_FSEL1(2U) |
                             HAL_PINCTRL_PLATFORM_IOMUXC_PAD_PD_MASK);
}
/***********************************************************************************************************************
 * EOF
 **********************************************************************************************************************/
